
///login and signup screen constants//ok
class LoginSignUpConstantsU {
  static const loginText= 'Логін';
  static const signUpText= "Зареєструватися";
  static const signintocontinueText= 'Увійти';
  static const enterEmailText= "Введіть Email";
  static const enterPasswordText= "Введіть Пароль";
  static const forgotpassText= "Забули пароль";
  static const dontHaveAccountText= "Немає облікового запису?";
  static const alreadyHaveAccountText= "Вже є обліковий запис?";
  static const welcomText= "Ласкаво просимо до BSafe";
  static const emailText= "Email";
  static const passwordText= "Пароль";
  static const confirmpassText= "Підтвердьте пароль";
  static const sendResetEmailText= "Надіслати для скидання";
}

///language or country selection screen constants///
class LCscreenConstantsU {
  static const selectCountryandlanguage="Виберіть країну і мову";
  static const countryHintText="Виберіть країну";
  static const languageHintText="Виберіть мову";
  static const buttonText="Зробити";
  static const poland="Польща";
  static const zcechC="Чеська Республіка";
  static const slovakia="Словаччина";
  static const english="Англійська";
  static const polish="Польська";
  static const czcechL="Чеська";
  static const slovak="Словацька";
  static const ukrain="Українська";
}

///HomeMainScreenContantsE///
class HomeMainScreenContantsU {
  static const homeAppBarText="Додому";
  static const localSupportAppBarText="Місцеві служби підтримки";
  static const journalAppBarText="Мій журнал";
  static const splashscreenConstants="Ти сильна";
}

///HomeScreenConstantsE//
class HomeScreenConstantsU {
  static const selectAnyOption="Виберіть будь-яку опцію:";
  static const myTrustedContacts="Мої довірені контакти";
  static const practicalAdvice="Практичні поради";
  static const typesOfSupport="Види підтримки";
  static const cyberBullying="Кіберзнущання та онлайн безпека";
  static const callPolice="Поліцію 112";
}

///Side Drawer screen//k
class SideDrawerConstantsU {
  static const seetingText="Налаштування";
  static const aboutbutton="Про BSafe";
  static const privacybutton="Політика конфіденційності";
  static const tandCbutton="Умови та положення";
  static const securitybutton="Режим безпеки";
  static const logout="Вийти";
  static const safetyButton="Поради з безпеки";
  ///double
  static const chooseLan="Choose Language";
  static const chooseContry="Choose Country";
  static const policeButton="Call police 112";
///
}

///Safety Advice screeen//k
class SafetyAdviceConstatntsU {
  static const mainTitle1="Важливі поради щодо безпечного використання додатка BSafe:";
  static const text1="У разі відчуття небезпеки негайно наберіть 112. Ви можете зробити це за допомогою функції виклику 112 усередині додатка або за допомогою клавіші вашого мобільного телефону.";
  static const text2="Задля вашої безпеки ми рекомендуємо завантажувати та використовувати додаток лише тоді, коли ви впевнені, що це безпечно, наприклад, якщо ви не живете з кривдником.Якщо ви зараз зазнаєте будь-якого виду насильства, будь ласка, не соромтеся звертатися до найближчої служби підтримки за допомогою функції ${'"Знайти місцеву допомогу"'} в додатку.";
  static const mainTitle2="Будь ласка, зверніть увагу на наступне:";
  static const bulletText1="Якщо ви плануєте використовувати функцію ${'"Мій журнал"'} у додатку, переконайтеся, що адреса електронної пошти, яку ви вибрали для надсилання записів, є безпечною і не може бути доступною нікому іншому. При необхідності створіть нову електронну адресу або використовуйте одну з надійного друга. ";
  static const bulletText2="Додаючи вміст у ${'"Мій журнал"'}, переконайтеся, що завантажені файли не зберігаються у вашій фотогалереї або альбомі. Перевірте налаштування телефону, щоб переконатися, що це так. ";
  static const bulletText3="Зверніть увагу, що будь-які дзвінки, здійснені за допомогою додатка, такі як 112 або служби місцевої підтримки, відображатимуться в історії дзвінків вашого мобільного телефону. Ви можете видалити ці дзвінки з історії дзвінків вашого телефону, якщо ви хвилюєтеся, що їх можуть виявити.";
  static const bulletText4="Перед відвідуванням служб підтримки ми рекомендуємо зв'язатися з ними заздалегідь, щоб дізнатися про їхнє місцезнаходження та години роботи.";
  static const bulletText5="Ми рекомендуємо активувати режим прикриття перед виходом з програми для додаткової безпеки.";
}

///about screen//k
class AboutConstantsU {
  static const aboutText="Наш проект BSAFE спрямований на запобігання та боротьбу з усіма формами сексуального та гендерного насильства (СГН) щодо вразливих жінок, які були змушені покинути свої країни походження через конфлікти. Мобільний додаток Bsafe надає практичну підтримку та інформацію щодо реагування на SGBV, допомагає знайти безпечний шлях до підтримки.Розроблено спільнотою Spolecnost Podane Ruce спільно з організаціями з Чеської Республіки, Польщі та Словаччини. Фінансується Європейським Союзом. Дізнайтеся більше на";
  ///double//
  static const aboutLink="www.projectbsafe.eu";
}

///mytrusted contacts Screen///k
class MyTrustedContactsConstantsU {
  static const addEdit ="Додавати та редагувати контакт";
  static const helpLine ="Лінія допомоги";
  static const addfavContacts ="Додати моїх довірених контактів";
  static const saveText ="Зберегти";
}


///practical advice main screen ///k
class PractivcalAdvsMainConstantsU {

  static const practicalAdvice="Практичні поради";
  static const selectAnyOption="Виберіть будь-яку опцію:";
  static const sexualgebdebaseButontext="Сексуальне та гендерно обумовлене насильство";
  static const SGBVformButontext="СГОН різні форми";

}

///Sexula Gender Based Violence screen constants///k

class SGBVscreenConstantsU {
  static const text ="СГОН означає Сексуальне та Гендерно Обумовлене Насильство. Посилається на будь-яку форму насильства або шкоди, яка переважно спрямована на окрему особу або групу осіб за ознакою їхньої статі або сексуальної орієнтації. СГОН є серйозною глобальною проблемою, яка впливає на осіб будь-якої статі, але вона надмірно торкається жінок та дівчат. Це порушення прав людини і ризик для здоров'я населення. В усьому світі докладаються зусилля для запобігання та подолання СГОН, підтримки жертв, просування гендерної рівності та поваги до прав усіх людей.";
}

///Sexula Gender Based Violence different form screen constants///k

class SGBVFormsConstantsU {
  static const SGBVencompasses ="СГОН охоплює різні форми насильства, зокрема:";
  static const sexualVoilence ="Сексуальне насильство";
  static const domesticVoilence ="Домашнє насильство";
  static const genderBVoilence ="Гендерне насильство";
  static const harmfulTradition ="Шкідливі практики, засновані на традиціях";
  static const descrimination ="Дискримінація та домагання";
  static const sexualVoilenceDes ="це включає зґвалтування, сексуальне напад, сексуальне домагання та будь-який небажаний сексуальний контакт чи примус.";
  static const domesticVoilenceDes ="насильство, яке відбувається в інтимних партнерських відносинах, часто включаючи фізичне, емоційне, психологічне чи економічне насильство.";
  static const genderBVoilencedDes ="акти насильства, що корінням в гендерних нерівностях та дискримінації, спрямовані проти осіб на підставі їх гендерної ідентичності чи вираження.";
  static const harmfulTraditionDes ="практики, такі як обрізання/відсічення жіночих статевих органів, дитяче шлюбство та вбивства з честі, які часто виконуються через традиційні вірування та суспільні норми.";
  static const descriminationDes ="будь-яка форма дискримінації чи домагання на підставі гендеру чи сексуальної орієнтації, що може включати дискримінацію на робочому місці, кіберзагрози чи злочини з ненависті.";

}

///practical advice detail screen ///k

class PracTicalAdviceConstantsU {
  static const mainTitle="Якщо ви є жертвою сексуального насильства, ось кілька кроків, які ви можете вжити:";
  static const title1="Залишайтеся на безпечному місці";
  static const title2="Звертайтеся до довіреної особи";
  static const title3="Відвідайте гінеколога";
  static const title4="Подумайте про те, щоб звернутися до поліції";
  static const title5="Звертайтеся за професійною допомогою";
  static const title6="Не залишайте це без уваги";
  static const description1="Спробуйте уникнути подальших контактів з нападником, якщо це можливо.";
  static const description2="Шукайте підтримки у близьких друзів, родини або терапевта. Розмова про травматичний досвід може допомогти в процесі загоєння.";
  static const description3="Важливо звернутися до гінеколога, навіть якщо це може бути важким. Причини включають лікування можливих фізичних травм, консультації щодо запобігання вагітності та профілактики захворювань, що передаються статевим шляхом.";
  static const description4="Рішення про звернення до поліції є дуже особистим. Якщо ви вирішите це зробити, вам доведеться пройти співбесіду, яка може бути складною. Якщо ви вирішите звернутися до поліції, докази, такі як одяг та інші предмети, з якими контактував кривдник, можуть допомогти в розслідуванні.";
  static const description5="Багатьом людям потрібна підтримка та розуміння від фахівців, таких як сексологи та психологи, для подолання наслідків сексуального насильства або зґвалтування. ";
  static const description6="Навіть якщо сексуальне насильство сталося в минулому, все ще можна вживати кроки до загоєння та можливого притягнення винуватця до відповідальності";
}

///types of suppoert screen
class TOSscreenConstantsU {
  static const appBarTitle = "Види підтримки";
  static const mainTitle = "Існує ряд різних видів послуг, доступних для підтримки осіб, які стикаються із Сексуальне та Гендерно обумовлене Насильство (СГОН). Вам не потрібно проходити через це самотужки. Дізнайтеся, що найкраще для вас.";
  static const title1 = "Поліція";
  static const title2 = "Проживання";
  static const title3 = "Консультативна терапія";
  static const title4 = "Групова підтримка";
  static const description1 = "СГОН є кримінальним злочином - поліція може надати життєво важливу підтримку. Коли ви або хтось, кого ви знаєте, знаходиться у негайній небезпеці, поліція часто найшвидше реагує. У таких ситуаціях дзвоніть за номером 112. Багато поліцейських сил мають навчений персонал, який спеціалізується на розслідуванні випадків насильства.";
  static const description2 = "Це безпечне пристановище для тих, хто повинен залишити свої домівки через насильство. Також там працює спеціалізований персонал, який може допомогти у практичних питаннях, таких як фінансова підтримка та пошук нового житла. Багато з цих установ також мають працівників, навчених підтримувати дітей.";
  static const description3 = "Досвід насильства може залишити тривалий слід на вашому самопочутті. Розмова з консультантом може допомогти вам зрозуміти свої враження та надати практичні стратегії для одужання. Важливо звертатися до консультанта, який має відповідну підготовку, такого як консультант, психолог або психотерапевт.";
  static const description4 = "Деякі служби проводять групові сесії підтримки, де ви та інші можуть одночасно спілкуватися з професіоналом, який спеціалізується на темі насильства Такий підхід може бути корисним, оскільки дозволяє отримати інформацію від інших людей, які діляться своїм досвідом і тим, що їм допомогло. ";
}

///CyberBullyingAndOnlineSafety screen main screen///

class CB_OSmainScreenConstantsU {
  static const appBarText="Кіберзнущання";
  static const mainTitle="Інтернет є важливою частиною нашого життя, часто непоміченою, оскільки ми використовуємо його для повсякденних справ. Проте важливо розуміти, що деякі види зловживань, відомі як технічні зловживання, можуть траплятися через пристрої та додатки, що підключені до Інтернету";
  static const cyberBullyingInConnection="Кіберзалякування у зв’язку з сексуальним насильством";
  static const onlineSafety="Онлайн безпеки";
}

///cyberbullying detaile screen ///

class CBscreenConstantsU {
  static const title="Простіше кажучи, йдеться про надсилання інтимних фотографій. Перш всього, ніколи не відправляйте особисті фотографії нікому, навіть другові чи тому, кому ви довіряєте, на будь-якій соціальній мережі. Чому? Тому що ви ніколи не знаєте, куди може потрапити фотографія.Якщо ви вже відправили фотографію, а тепер хтось змушує вас відправити більше чи робити речі, які вам не хочеться, загрожуючи відправити ваші фотографії іншим, не піддавайтеся! Не відповідайте на повідомлення і не дозволяйте себе шантажувати.Не видаляйте розмову. Зверніться за професійною допомогою у розділі, де ви можете отримати допомогу в цьому питанні.   Повідомте про це негайно. У соціальних мережах є кнопки повідомлення, які дозволяють вам повідомити про неприпустимий вміст.";
}

///online safety detaile screen ///

class OSscreenConstantsU {
  static const mainTitle="Не існує єдиного рішення, яке б зупинило насильство над кимось в Інтернеті, але є багато способів значно ускладнити життя тим, хто це робить.";
  static const socialMedia="Cоц.медіа";
  static const socialMediaText="Соціальні медіаплатформи, такі як Facebook, Instagram, X, Snapchat та TikTok, можуть розкривати інформацію про вас, включаючи ваше місцезнаходження, яку зловживач може використовувати. Вони також можуть бути використані для переслідування та передачі особистої інформації без вашої згоди. Будьте обачливі при використанні цих платформ для забезпечення своєї безпеки.";
  static const socialMediaBulletText1="Переглядайте налаштування конфіденційності, щоб контролювати, хто може переглядати ваші публікації.";
  static const socialMediaBulletText2="Заблокуйте будь-кого, кого ви хочете позбавити доступу до вашої інформації.";
  static const socialMediaBulletText3="Переконайтеся, що ваш пароль надійний і безпечний.";
  static const socialMediaBulletText4="•	Докладно перевіряйте інформацію в своєму профілі на предмет того, що може бути використано проти вас";
  static const messegingTitle="Програми обміну повідомленнями";
  static const messegingText="Програми для обміну повідомленнями, такі як WhatsApp і Messenger, можуть здаватися безпечними засобами комунікації, але важливо знати про потенційні ризики, щоб залишатися в безпеці.Наприклад, вас можуть додати до груп із людьми, яких ви не знаєте. Обмін повідомленнями також може бути використаний для переслідування або утисків, наприклад, якщо ви отримуєте багато небажаних повідомлень, у тому числі тривожні зображення або відео. Будьте пильні та вживайте необхідних заходів для захисту.";
  static const phone="Телефон";
  static const phoneText1="Багато з нас носять свої телефони всюди, і вони містять величезну кількість особистої інформації. Вони можуть розкривати ваше місцеположення, контакти, банківські дані, листування електронною поштою і навіть дані про здоров'я. Важливо захистити цю інформацію, щоб запобігти потенційному зловживанню, зокрема переслідуванню, стеженню, приниженню, переслідуванню та крадіжці.";
  static const phoneBulluetTitle="Ось кілька кроків для захисту себе:";
  static const phoneBulluetText1="Використовуйте міцний і безпечний пароль.";
  static const phoneBulluetText2="Подумайте про те, щоб завантажити антивірусну програму для перевірки на наявність ${'"шпигунських"'} програм (шпигунське програмне забезпечення), які могли бути встановлені на ваш телефон без вашого відома.";
  static const phoneBulluetText3="Вимкніть відстеження вашого місцезнаходження для підвищення рівня вашої безпеки.";
}

///find local screen constants///

class FLscreenConstantsU {
  static const appBarText="Місцеві служби підтримки";
  static const hintText="Шукати тут";
  static const title="Місцева допомога";
  ///double///
  static const text1="Help Line";
  static const text2="Emergency";
  static const text3="Sexual Abuse Help Line";
  static const text4="Cyber Bullying Help Line";
  static const text5="Lorem Ipsum";
  static const number="12345678";
///
}


///my journal screen constants///
class MyJournalConstantsU {
  static const title="Ведення щоденника - цінний спосіб задокументувати будь-яке насильство, якого ви зазнали. Ці записи можуть бути корисними для будь-яких юридичних дій, які ви вирішите здійснити в майбутньому.${'"Мій журнал"'} допоможе вам у цьому процесі. Важливо знати, що все, що ви записуєте за допомогою цього інструменту, не зберігається на вашому пристрої, що гарантує вашу конфіденційність і безпеку.";
  static const hintText="Write Something...";
  static const welcomText="Ласкаво просимо до ${'"мій журнал"'}. ";
  static const title1="Коли це сталося?";
  static const title2="Що сталося?";
  static const title3="Як це сталося?";
  static const safetyEmail="Безпечний електронний лист";
  static const sendText="надіслати";
  static const cancelText="Скасувати";
  ///double
  static const title4="Завантажте зображення або відео";
  static const title5="Запис звуку";
  static const button1="Завантажити";
  static const button2="Start";
  static const button3="Надіслати";
}


///PrivacyPolicy screen//////
class PrivacyPolicyConstantsU {
  static const text1 ="Ми цінуємо вашу конфіденційність і хочемо запевнити вас, що ваші особисті дані обробляються з найбільшою обережністю. Термін 'особиста інформація' відноситься до будь-яких даних, які можуть ідентифікувати вас як індивіда. Будьте впевнені, що коли ви завантажуєте і використовуєте цю програму, ваша особиста інформація залишається недоторканою і необробленою.";
  static const text2 ="Коли ви використовуєте функцію 'Мій Журнал', будь ласка, майте на увазі, що інформація, яку ви вводите, не зберігається на вашому пристрої, в програмі або на наших серверах. Ми серйозно ставимося до вашої конфіденційності і, відповідно до цього, ми не зберігаємо доступ до жодних записів, створених за допомогою функції 'Мій Журнал'. Якщо ви бажаєте отримувати записи з вашого журналу по електронній пошті, у вас є можливість надати свою адресу електронної пошти. Важливо знати, що ми не зберігаємо записів вашої адреси електронної пошти або вмісту ваших записів. Вам потрібно буде вводити свою адресу електронної пошти кожного разу, коли ви використовуєте функцію 'Мій Журнал', забезпечуючи тим самим безпеку ваших даних.";
  static const text3 = "Ми хочемо підкреслити, що ми не ділимося жодною інформацією з третіми сторонами, і жодні дані ніколи не передаються далі. Ваша конфіденційність має для нас найвищий пріоритет, і ми зобов'язані захищати вашу особисту інформацію.";
}


///terms & condition screen
class TermANdCondConstantsU {
  static const MainTitle ="Перш ніж почати використовувати додаток, будь ласка, відведіть хвилину, щоб прочитати наступні умови і положення:";
  static const Title1 ="Призначення додатку";
  static const Title2 ="Заходи безпеки";
  static const Title3 ="Відповідальність користувача";
  static const Title4 ="Конфіденційність";
  static const Title5 ="Оновлення додатку";
  static const Title6 ="Екстрені служби";
  static const Title7 ="Зворотній зв'язок";
  static const Title8 ="Припинення доступу";
  static const Title9 ="Виконання закону";
  static const Title10 ="Відмова від відповідальності";
  static const d1 ="Наш додаток призначений виключно для надання допомоги та ресурсів жінкам, які переживають насильство на гендерній основі. Він не призначений для використання в інших цілях.";
  static const d2 ="Ваша безпека дуже важлива. Користуючись додатком в потенційно небезпечних ситуаціях, будь ласка, переконайтеся, що вживаєте відповідних заходів для свого захисту. Додаток є інструментом, який може вам допомогти, але він не повинен замінювати звернення за допомогою до правоохоронних органів чи інших відповідних установ.";
  static const d3 ="Ви відповідаєте за надану вами інформацію та за дії, які ви виконуєте під час використання додатка.";
  static const d4 ="Ми серйозно ставимося до вашої конфіденційності. Ми не передаємо вашу особисту інформацію третім сторонам. Будь ласка, ознайомтеся з нашою Політикою конфіденційності для отримання додаткових деталей.";
  static const d5 ="Для забезпечення вашої безпеки важливо регулярно оновлювати додаток до останньої версії. Ми можемо періодично випускати оновлення з новими функціями чи покращеннями безпеки.";
  static const d6 ="У разі аварійної ситуації завжди негайно дзвоніть на місцевий номер екстреної допомоги. Наш додаток не є заміною екстреної допомоги.";
  static const d7 ="Ми цінуємо вашу думку, тому, якщо у вас є пропозиції щодо покращення, будь ласка, надсилайте їх на електронну адресу ";
  static const d8 ="Ми залишаємо за собою право припинити ваш доступ до додатка за нашим розсудом, якщо ви порушите ці умови та положення або зловживаєте додатком.";
  static const d9 ="Ви погоджуєтеся використовувати додаток відповідно до всіх чинних законів і правил, що стосуються насильства на гендерній основі і особистої безпеки.";
  static const d10 ="Незважаючи на наші зусилля надати точну та корисну інформацію, ми не можемо гарантувати її точність, надійність або ефективність ресурсів, наданих в додатку.";

}

